title: Cisco Sniffing
id: b9e1f193-d236-4451-aaae-2f3d2102120d
status: experimental
description: Show when a monitor or a span/rspan is setup or modified
author: Austin Clark
date: 2019/08/11
modified: 2021/01/03
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'monitor capture point'
        - 'set span'
        - 'set rspan'
        - 'monitor session'
    condition: keywords
falsepositives:
    - Admins may setup new or modify old spans, or use a monitor for troubleshooting
level: medium
tags:
    - attack.credential_access
    - attack.discovery
    - attack.exfiltration
    - attack.t1040
    - attack.t1020.001