title: Cisco Get Credentials
id: b094d9fb-b1ad-4650-9f1a-fb7be9f1d34b
status: experimental
description: See what passwords and keys are in the local log, history, or archive files
author: Austin Clark
date: 2019/08/11
modified: 2020/09/02
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'show history'
        - 'show history all'
        - 'show logging'
        - 'show archive log config'
    condition: keywords
falsepositives:
    - Not commonly run by administrators, especially if remote logging is configured
level: medium
tags:
    - attack.credential_access
    - attack.t1552.003
    - attack.t1552.001