title: Clear Command History
status: experimental
description: Clear command history in network OS which is used for defense evasion.
references:
    - https://attack.mitre.org/techniques/T1146/
author: Austin Clark
date: 2019/08/11
tags:
    - attack.defense_evasion
    - attack.t1146
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'clear logging'
        - 'clear archive'
    condition: keywords
falsepositives:
    - Legitimate administrators may run these commands.
level: high