title: Find Credentials
status: experimental
description: Show what credentials were input into the command line from the history
references:
    - https://attack.mitre.org/techniques/T1139
author: Austin Clark
date: 2019/08/11
tags:
    - attack.credential_access
    - attack.t1139
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'show history all'
    condition: keywords
falsepositives:
    - Not commonly run by administrators, especially if remote logging is configured.
level: high