title: Discover Local Accounts
status: experimental
description: Find local account names in the configuration files
references:
    - https://attack.mitre.org/techniques/T1087
    - https://attack.mitre.org/techniques/T1003
    - https://attack.mitre.org/techniques/T1081
author: Austin Clark
date: 2019/08/11
tags:
    - attack.discovery
    - attack.credential_access
    - attack.t1087
    - attack.t1003
    - attack.t1081
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'show running-config'
        - 'show startup-config'
        - 'show archive config'
    condition: keywords
falsepositives:
    - Commonly run by administrators.
level: low